In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/sales

In [ ]:
LOAD DATA LOCAL INFILE 
"C:/Users/Kathiravan/Downloads/ecom/amazon_sales_cleaned.csv"
INTO TABLE staging_sales
FIELDS TERMINATED BY ','
ENCLOSED BY '"'
LINES TERMINATED BY '\r\n'
IGNORE 1 ROWS
(order_id, date, amount, status, order_month, order_year);

In [7]:
%%sql
CREATE TABLE order_items (
    order_item_id INT AUTO_INCREMENT PRIMARY KEY,
    order_id VARCHAR(50),
    product_id INT,
    quantity INT,
    total_price DECIMAL(12,2),
    FOREIGN KEY (order_id) REFERENCES orders(order_id),
    FOREIGN KEY (product_id) REFERENCES products(product_id)
);

 * mysql+mysqlconnector://root:***@localhost/sales
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'order_items' already exists
[SQL: CREATE TABLE order_items (
    order_item_id INT AUTO_INCREMENT PRIMARY KEY,
    order_id VARCHAR(50),
    product_id INT,
    quantity INT,
    total_price DECIMAL(12,2),
    FOREIGN KEY (order_id) REFERENCES orders(order_id),
    FOREIGN KEY (product_id) REFERENCES products(product_id)
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [ ]:
%%sql
CREATE TABLE products (
    product_id INT AUTO_INCREMENT PRIMARY KEY,
    sku VARCHAR(50) UNIQUE,
    category VARCHAR(50),
    price DECIMAL(10,2)
);

In [ ]:
%%sql
CREATE TABLE orders (
    order_id VARCHAR(50) PRIMARY KEY,
    order_date DATE NOT NULL,
    customer_id INT,
    order_status VARCHAR(30),
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
);

In [ ]:
%%sql
CREATE TABLE customers (
    customer_id INT AUTO_INCREMENT PRIMARY KEY,
    region VARCHAR(50),
    country VARCHAR(50),
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

In [ ]:
%%sql
CREATE TABLE staging_sales (
    order_id VARCHAR(50),
    order_date_raw VARCHAR(30),
    sku VARCHAR(50),
    category VARCHAR(50),
    price VARCHAR(30),
    quantity VARCHAR(30),
    region VARCHAR(50),
    country VARCHAR(50)
);

In [ ]:
%%sql
INSERT INTO orders (order_id, order_date, customer_id, order_status)
SELECT
    s.order_id,
    STR_TO_DATE(MAX(s.order_date_raw), '%m-%d-%y') AS order_date,
    c.customer_id,
    'COMPLETED' AS order_status
FROM staging_sales s
JOIN customers c
  ON s.region = c.region
 AND s.country = c.country
LEFT JOIN orders o
  ON s.order_id = o.order_id
WHERE o.order_id IS NULL
  AND s.order_id IS NOT NULL
  AND s.order_date_raw IS NOT NULL
GROUP BY
    s.order_id,
    c.customer_id;

In [6]:
%%sql
SELECT
  p.category,
  ROUND(SUM(oi.total_price), 2) AS revenue
FROM order_items oi
JOIN products p ON oi.product_id = p.product_id
GROUP BY p.category
ORDER BY revenue DESC;

 * mysql+mysqlconnector://root:***@localhost/sales
9 rows affected.

[('Set', Decimal('48988643.74')),
 ('kurta', Decimal('27592955.14')),
 ('Western Dress', Decimal('17808116.22')),
 ('Top', Decimal('7154795.78')),
 ('Ethnic Dress', Decimal('1008146.00')),
 ('Blouse', Decimal('587297.22')),
 ('Bottom', Decimal('155460.06')),
 ('Saree', Decimal('139060.00')),
 ('Dupatta', Decimal('915.00'))]

In [ ]:
%%sql
CREATE INDEX idx_order_date ON orders(order_date);
CREATE INDEX idx_product_category ON products(category);

In [2]:
%%sql
SELECT COUNT(*) FROM orders;
SELECT COUNT(*) FROM order_items;
SELECT COUNT(*) FROM products;
SELECT COUNT(*) FROM customers;

 * mysql+mysqlconnector://root:***@localhost/sales
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[(94,)]

In [9]:
%%sql
SELECT
  ROUND(SUM(total_price), 2) AS total_revenue
FROM order_items;

 * mysql+mysqlconnector://root:***@localhost/sales
1 rows affected.

[(Decimal('103435389.16'),)]

In [ ]:
SHOW VARIABLES LIKE 'local_infile';

SET GLOBAL local_infile = 1;
use sales;

In [ ]:
INSERT INTO products (sku, category, price)
SELECT
    s.sku,
    MAX(s.category) AS category,
    MAX(CAST(s.price AS DECIMAL(10,2))) AS price
FROM staging_sales s
LEFT JOIN products p
       ON s.sku = p.sku
WHERE p.sku IS NULL
  AND s.sku IS NOT NULL
  AND s.price REGEXP '^[0-9]+(\\.[0-9]+)?$'
GROUP BY
    s.sku;

In [ ]:
%%sql 
INSERT INTO customers (region, country)
SELECT DISTINCT
    region,
    country
FROM staging_sales
WHERE region IS NOT NULL
  AND country IS NOT NULL;

In [10]:
%%sql
DESCRIBE staging_sales;

 * mysql+mysqlconnector://root:***@localhost/sales
9 rows affected.

[('order_id', 'varchar(50)', 'YES', '', None, ''),
 ('order_date_raw', 'varchar(30)', 'YES', '', None, ''),
 ('sku', 'varchar(50)', 'YES', '', None, ''),
 ('category', 'varchar(50)', 'YES', '', None, ''),
 ('price', 'varchar(30)', 'YES', '', None, ''),
 ('quantity', 'varchar(30)', 'YES', '', None, ''),
 ('region', 'varchar(50)', 'YES', '', None, ''),
 ('country', 'varchar(50)', 'YES', '', None, ''),
 ('staging_id', 'int', 'NO', 'PRI', None, 'auto_increment')]

In [12]:
%%sql
select count(*)
from staging_sales

 * mysql+mysqlconnector://root:***@localhost/sales
1 rows affected.

[(128975,)]

In [22]:
%%sql
#Monthly Revenue Trend
SELECT
  DATE_FORMAT(o.order_date, '%Y-%m') AS month,
  ROUND(SUM(oi.total_price), 2) AS revenue
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
GROUP BY month
ORDER BY month;

 * mysql+mysqlconnector://root:***@localhost/sales
4 rows affected.

[('2022-03', Decimal('135751.00')),
 ('2022-04', Decimal('39167974.06')),
 ('2022-05', Decimal('34427781.06')),
 ('2022-06', Decimal('29703883.04'))]

In [21]:
%%sql
#Month-over-Month (MoM) Growth
WITH monthly_sales AS (
  SELECT
    DATE_FORMAT(o.order_date, '%Y-%m') AS month,
    SUM(oi.total_price) AS revenue
  FROM orders o
  JOIN order_items oi ON o.order_id = oi.order_id
  GROUP BY month
)
SELECT
  month,
  revenue,
  ROUND(
    (revenue - LAG(revenue) OVER (ORDER BY month))
    / LAG(revenue) OVER (ORDER BY month) * 100,
    2
  ) AS mom_growth_pct
FROM monthly_sales
ORDER BY month;

 * mysql+mysqlconnector://root:***@localhost/sales
4 rows affected.

[('2022-03', Decimal('135751.00'), None),
 ('2022-04', Decimal('39167974.06'), Decimal('28752.81')),
 ('2022-05', Decimal('34427781.06'), Decimal('-12.10')),
 ('2022-06', Decimal('29703883.04'), Decimal('-13.72'))]

In [20]:
%%sql
# Revenue by Category
SELECT
  p.category,
  ROUND(SUM(oi.total_price), 2) AS revenue
FROM order_items oi
JOIN products p ON oi.product_id = p.product_id
GROUP BY p.category
ORDER BY revenue DESC;

 * mysql+mysqlconnector://root:***@localhost/sales
9 rows affected.

[('Set', Decimal('48988643.74')),
 ('kurta', Decimal('27592955.14')),
 ('Western Dress', Decimal('17808116.22')),
 ('Top', Decimal('7154795.78')),
 ('Ethnic Dress', Decimal('1008146.00')),
 ('Blouse', Decimal('587297.22')),
 ('Bottom', Decimal('155460.06')),
 ('Saree', Decimal('139060.00')),
 ('Dupatta', Decimal('915.00'))]

In [19]:
%%sql
# Revenue by Region
SELECT
  c.region,
  ROUND(SUM(oi.total_price), 2) AS revenue
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
JOIN customers c ON o.customer_id = c.customer_id
GROUP BY c.region
ORDER BY revenue DESC;

 * mysql+mysqlconnector://root:***@localhost/sales
47 rows affected.

[('MAHARASHTRA', Decimal('17763484.73')),
 ('KARNATAKA', Decimal('13961252.25')),
 ('TELANGANA', Decimal('9130488.37')),
 ('UTTAR PRADESH', Decimal('8857869.95')),
 ('TAMIL NADU', Decimal('8628234.07')),
 ('DELHI', Decimal('5635055.22')),
 ('KERALA', Decimal('5110928.51')),
 ('WEST BENGAL', Decimal('4590798.36')),
 ('ANDHRA PRADESH', Decimal('4185741.21')),
 ('HARYANA', Decimal('3778120.86')),
 ('Gujarat', Decimal('3691291.40')),
 ('RAJASTHAN', Decimal('2235724.05')),
 ('MADHYA PRADESH', Decimal('2064263.72')),
 ('BIHAR', Decimal('1860012.88')),
 ('ODISHA', Decimal('1764039.62')),
 ('PUNJAB', Decimal('1580541.77')),
 ('ASSAM', Decimal('1314285.26')),
 ('UTTARAKHAND', Decimal('1268834.24')),
 ('JHARKHAND', Decimal('1223783.59')),
 ('Goa', Decimal('877952.82')),
 ('CHHATTISGARH', Decimal('760210.64')),
 ('HIMACHAL PRADESH', Decimal('616368.40')),
 ('JAMMU & KASHMIR', Decimal('551463.78')),
 ('CHANDIGARH', Decimal('279358.76')),
 ('MANIPUR', Decimal('270270.00')),
 ('PUDUCHERRY', Decimal('234012.00')),
 ('ANDAMAN & NICOBAR ', Decimal('204513.62')),
 ('NAGALAND', Decimal('202117.82')),
 ('SIKKIM', Decimal('177205.74')),
 ('MEGHALAYA', Decimal('145998.80')),
 ('ARUNACHAL PRADESH', Decimal('122532.00')),
 ('TRIPURA', Decimal('120867.00')),
 ('New Delhi', Decimal('62278.00')),
 ('DADRA AND NAGAR', Decimal('55652.00')),
 ('MIZORAM', Decimal('48772.00')),
 ('LADAKH', Decimal('47246.72')),
 ('LAKSHADWEEP', Decimal('3300.00')),
 ('orissa', Decimal('2469.00')),
 ('NL', Decimal('1579.00')),
 ('RJ', Decimal('1485.00')),
 ('rajsthan', Decimal('1318.00')),
 ('Rajshthan', Decimal('1210.00')),
 ('AR', Decimal('698.00')),
 ('Pondicherry', Decimal('693.00')),
 ('Punjab/Mohali/Zirakpur', Decimal('568.00')),
 ('PB', Decimal('499.00')),
 ('APO', Decimal('0.00'))]

In [17]:
%%sql
# Average Order Value (AOV)
SELECT
  ROUND(
    SUM(oi.total_price) / COUNT(DISTINCT o.order_id),
    2
  ) AS avg_order_value
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id;

 * mysql+mysqlconnector://root:***@localhost/sales
1 rows affected.

[(Decimal('859.73'),)]